Applying **dev**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.terraform_state will be created
+   resource "aws_s3_bucket" "terraform_state" {
+       acceleration_status                  = (known after apply)
+       acl                                  = (known after apply)
+       arn                                  = (known after apply)
+       bucket                               = "andrei-terraform-state"
+       bucket_domain_name                   = (known after apply)
+       bucket_regional_domain_name          = (known after apply)
+       cors_rule                            = (known after apply)
+       force_destroy                        = false
+       grant                                = (known after apply)
+       hosted_zone_id                       = (known after apply)
+       id                                   = (known after apply)
+       lifecycle_rule                       = (known after apply)
+       logging                              = (known after apply)
+       object_lock_enabled                  = (known after apply)
+       policy                               = (known after apply)
+       region                               = (known after apply)
+       replication_configuration            = (known after apply)
+       request_payer                        = (known after apply)
+       server_side_encryption_configuration = (known after apply)
+       tags_all                             = (known after apply)
+       versioning                           = (known after apply)
+       website                              = (known after apply)
+       website_domain                       = (known after apply)
+       website_endpoint                     = (known after apply)

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)
+           rule                = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

```
aws_s3_bucket.terraform_state: Creating...
aws_s3_bucket.terraform_state: Still creating... [10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [1m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [1m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [1m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [1m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [1m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [1m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [2m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [2m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [2m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [2m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [2m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [2m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [3m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [3m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [3m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [3m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [3m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [3m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [4m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [4m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [4m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [4m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [4m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [4m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [5m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [5m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [5m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [5m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [5m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [5m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [6m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [6m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [6m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [6m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [6m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [6m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [7m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [7m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [7m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [7m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [7m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [7m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [8m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [8m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [8m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [8m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [8m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [8m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [9m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [9m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [9m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [9m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [9m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [9m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [10m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [10m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [10m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [10m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [10m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [10m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [11m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [11m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [11m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [11m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [11m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [11m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [12m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [12m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [12m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [12m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [12m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [12m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [13m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [13m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [13m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [13m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [13m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [13m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [14m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [14m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [14m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [14m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [14m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [14m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [15m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [15m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [15m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [15m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [15m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [15m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [16m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [16m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [16m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [16m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [16m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [16m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [17m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [17m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [17m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [17m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [17m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [17m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [18m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [18m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [18m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [18m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [18m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [18m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [19m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [19m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [19m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [19m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [19m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [19m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [20m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [20m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [20m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [20m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [20m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [20m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [21m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [21m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [21m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [21m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [21m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [21m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [22m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [22m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [22m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [22m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [22m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [22m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [23m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [23m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [23m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [23m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [23m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [23m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [24m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [24m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [24m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [24m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [24m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [24m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [25m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [25m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [25m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [25m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [25m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [25m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [26m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [26m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [26m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [26m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [26m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [26m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [27m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [27m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [27m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [27m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [27m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [27m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [28m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [28m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [28m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [28m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [28m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [28m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [29m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [29m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [29m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [29m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [29m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [29m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [30m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [30m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [30m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [30m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [30m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [30m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [31m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [31m10s elapsed]
aws_s3_bucket.terraform_state: Still creating... [31m20s elapsed]
aws_s3_bucket.terraform_state: Still creating... [31m30s elapsed]
aws_s3_bucket.terraform_state: Still creating... [31m40s elapsed]
aws_s3_bucket.terraform_state: Still creating... [31m50s elapsed]
aws_s3_bucket.terraform_state: Still creating... [32m0s elapsed]
aws_s3_bucket.terraform_state: Still creating... [32m10s elapsed]
aws_s3_bucket.terraform_state: Creation complete after 32m19s [id=andrei-terraform-state]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```